app/views/posts/_form.html.erb

SELECT "tags".* FROM "tags"
---
    <%= f.label :tags %><br>
    <%= f.collection_check_boxes :tag_ids, Tag.all, :id, :name %><br>