app/views/posts/new.html.erb

SELECT "tags".* FROM "tags"
---
  <%= f.text_field :content %><br>
  <%= f.collection_check_boxes :tag_id, Tag.all, :id, :name %>