app/views/posts/show.html.erb

SELECT "post_tags".* FROM "post_tags" WHERE "post_tags"."post_id" = ?  [["post_id", 5]]
SELECT "tags".* FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = ?  [["post_id", 3]]
SELECT  "post_tags".* FROM "post_tags" WHERE "post_tags"."id" = ? LIMIT 1  [["id", 18]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 77]]
---
   <h3>Tag(s):</h3>
  <% @post.tag_ids.each do |tag_id|%>
  <%= Tag.find_by(id: tag_id).name %>