app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY "posts"."id" DESC LIMIT 1
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ?  ORDER BY "tags"."id" ASC LIMIT 1  [["id", 205]]
SELECT "post_tags".* FROM "post_tags" WHERE "post_tags"."post_id" = ?  [["post_id", 2]]
INSERT INTO "post_tags" ("tag_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tag_id", 227], ["post_id", 1], ["created_at", "2015-09-07 23:30:53.783835"], ["updated_at", "2015-09-07 23:30:53.783835"]]
INSERT INTO "posts" ("name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "afa"], ["content", "afa"], ["created_at", "2015-09-07 23:04:47.492215"], ["updated_at", "2015-09-07 23:04:47.492215"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "adventurous"], ["created_at", "2015-09-07 23:30:52.431983"], ["updated_at", "2015-09-07 23:30:52.431983"]]
---
  def create
    @post = Post.new(post_params)
    params["post"]["tag_ids"].each do |tag_id|
      if tag_id.length > 0
      taggie = Tag.find(tag_id)
      taggie.posts << @post